<template>
    <div class="v-about">
        <div class="v-container">
            <vItemVue ver="2" title="О нас" />
            <div style="margin-top: 100px;">
                <p align="justify">Парк компании насчитывает более 750 собственных автомобилей и представлен 65 различными марками/моделями.</p>
                <p align="justify">Так как безопасность клиентов является приоритетом нашей компании, мы гарантируем вам аренду только самых качественных, новых и соответствующих мировым стандартам безопасности автомобилей.</p>
                <p align="justify">Максимальный срок эксплуатации машины по специально разработанным стандартам компании Storlet Car Rental не может превышать два года. В нашем парке представлены только автомобили с максимальным количеством подушек безопасности. Кроме того, мы всегда готовы совершенно бесплатно предоставить детское кресло независимо от того, какой бы автомобиль Вы ни выбрали и на какой срок. Все модели по стандартам Storlet Car Rental оснащены качественными навигационными системами, которые помогут Вам не заблудиться и всегда найти дорогу домой. Кроме того, в каждом автомобиле Вы найдете зарядку для мобильных устройств.</p>
                <p align="justify">Во главе нашего бизнеса мы поставили высокий уровень сервиса, соблюдение стандартов качества оказываемых услуг, корпоративную культуру, надежность автомобилей и низкие цены.</p>
            </div>
        </div>
    </div>
</template>

<script>
import vItemVue from "@/components/Item/v-item.vue";

export default {
    components: {
        vItemVue
    }
}

</script>

<style scoped>
.v-about {
    background: #292521;
    color: #fff;
    padding: 40px;
    border-top: 2px solid #fff;
}

p {
    margin: 20px 0px;
}
</style>