<template>
    <div class="v-conf">
        <div class="v-container">
            <h1>Политики конфиденциальности и оплаты</h1>
            <h2>Платежи. Оплата банковской картой онлайн</h2>
            <p align="justify">Наш сайт подключен к интернет-эквайрингу, и Вы можете оплатить Услугу банковской картой Visa или Mastercard. После подтверждения бронирования откроется защищенное окно с платежной страницей процессингового центра CloudPayments, где Вам необходимо ввести данные Вашей банковской карты. Для дополнительной аутентификации держателя карты используется протокол 3D Secure. Если Ваш Банк поддерживает данную технологию, Вы будете перенаправлены на его сервер для дополнительной идентификации.</p>
            <p align="justify">Информацию о правилах и методах дополнительной идентификации уточняйте в Банке, выдавшем Вам банковскую карту.</p>
        
            <h2>Гарантии безопасности</h2>
            <p align="justify">Процессинговый центр CloudPayments защищает и обрабатывает данные Вашей банковской карты по стандарту безопасности PCI DSS 3.0. Передача информации в платежный шлюз происходит с применением технологии шифрования SSL. Дальнейшая передача информации происходит по закрытым банковским сетям, имеющим наивысший уровень надежности. CloudPayments не передает данные Вашей карты нам и иным третьим лицам. Для дополнительной аутентификации держателя карты используется протокол 3D Secure.</p>
            <p align="justify">В случае, если у Вас есть вопросы по совершенному платежу, Вы можете обратиться в службу поддержки клиентов по электронной почте world@avto777.com </p>

            <h2>Безопасность онлайн платежей</h2>
            <p align="justify">Предоставляемая Вами персональная информация (имя, адрес, телефон, e-mail, номер кредитной карты) является конфиденциальной и не подлежит разглашению. Данные Вашей кредитной карты передаются только в зашифрованном виде и не сохраняются на нашем Web-сервере.</p>
            <p align="justify">Безопасность обработки Интернет-платежей гарантирует ООО «КлаудПэйментс». Все операции с платежными картами происходят в соответствии с требованиями VISA International, MasterCard и других платежных систем. При передаче информации используется специальные технологии безопасности карточных онлайн-платежей, обработка данных ведется на безопасном высокотехнологичном сервере процессинговой компании.</p>

            <h2>Шифрование данных</h2>
            <p align="justify">Для защиты данных покупателя используется шифрование на транспортном уровне — TLS 1.2 и на прикладном уровне алгоритмом RSA с длиной ключа 2048 бит.</p>
            <p align="justify"></p>
        </div>
    </div>
</template>

<style scoped>
p,h2,h1 {
    margin: 30px 0px;
}

</style>