<template>
    <div class="v-item">
        <h2 class="v-title">{{ title }}</h2>
        <div class="v-inner" v-if="ver == 1">
            <vItemBlockVue 
                v-for="item in items"
                :image="item.image"
                :title="item.title"
                :text="item.text"
                :key="item"
            />
        </div>
        <div class="v-inner" v-if="ver == 2">
            <vItemBlockVue 
                v-for="item in about"
                :image="item.image"
                :title="item.title"
                :text="item.text"
                :key="item"
            />
        </div>
    </div>
</template>

<script>
import vItemBlockVue from './v-item-block.vue'

export default {
    components: {
        vItemBlockVue
    },

    props: {
        title: String,
        ver: Number
    },

    data() {
        return {
            items: [
                {'image': "icon/1.png", 'title': "Арендуйте бесплатно", 'text': 'Копите мили с помощью бонусной карты и арендуйте автомобили бесплатно! Предложение действительно для всех городов и стран, где есть наши станции проката. На карту клиента зачисляется не менее 10% от стоимости дневной аренды, а 1 миля равна 1 рублю.'},
                {'image': "icon/2.png", 'title': "Только новые", 'text': 'Все машины, которые предлагает в аренду компания Storlet Car Rental — новые. Парк автомобилей постоянно обновляется, так как по специально разработанным стандартам машины нашей компании не должны эксплуатироваться более двух лет.'},
                {'image': "icon/3.png", 'title': "Подача по городу", 'text': 'Арендованный Вами автомобиль может быть подан в любую точку города, туда, где Вам будет удобно забрать его. Это может быть Ваш адрес, любая станция метро, вокзал или аэропорт. В аэропорт «Пулково» и на Московский вокзал автомобили подаются бесплатно.'},
                {'image': "icon/4.png", 'title': "Гарантия низких цен", 'text': 'Мы — первая компания-дискаунтер на рынке аренды автомобилей. У нас Вы всегда найдете интересующий Вас автомобиль любого класса по лучшей цене в своем регионе. Клиентам гарантированы низкие цены на аренду автомобилей в сочетании с их высоким качеством.'},
            ],

            about: [
                {"image": "https://cdn-icons-png.flaticon.com/128/5332/5332730.png", "text": "Уникальная система лояльности — карта клиента Storlet Car Rental Privilege позволяет накапливать мили, пока вы пользуетесь машиной, а затем бесплатно брать в аренду автомобили по всему миру в пунктах проката Storlet. Мили зачисляются на карту каждый день!"},
                {"image": "https://cdn-icons-png.flaticon.com/128/167/167755.png", "text": "Специально для наших клиентов мы разработали программу стандартов Storlet Car Rental, которая обеспечивает вас новым автомобилем бюджетного, семейного или премиум-класса, гарантирует его высочайшее качество, а также безупречный сервис работы с клиентами."},
                {"image": "https://cdn-icons-png.flaticon.com/128/10473/10473692.png", "text": "Storlet Car Rental — не только первая российская компания, которая экспортирует подобный бизнес в ЕС и США, а значит, позволяет нашим клиентам пользоваться услугами аренды по всему миру, но и первая компания-дискаунтер в этом сегменте российского рынка."}
            ]
        }
    },
}
</script>

<style>
.v-title {
    font-size: 40px;
    text-align: center;
    margin: 45px 0px;
}
</style>