<template>
    <div class="v-item">
        <h2 class="v-title">Хотите арендовать автомобиль?</h2>
        <div class="v-inner">
            <vItemBlockVue 
                v-for="item in items"
                :image="item.image"
                :title="item.title"
                :text="item.text"
                :key="item"
            />
        </div>
    </div>
</template>

<script>
import vItemBlockVue from './v-item-block.vue'

export default {
    components: {
        vItemBlockVue
    },

    data() {
        return {
            items: [
                {'image': "icon/1.png", 'title': "Арендуйте бесплатно", 'text': 'Копите мили с помощью бонусной карты и арендуйте автомобили бесплатно! Предложение действительно для всех городов и стран, где есть наши станции проката. На карту клиента зачисляется не менее 10% от стоимости дневной аренды, а 1 миля равна 1 рублю.'},
                {'image': "icon/2.png", 'title': "Только новые", 'text': 'Все машины, которые предлагает в аренду компания Storlet Car Rental — новые. Парк автомобилей постоянно обновляется, так как по специально разработанным стандартам машины нашей компании не должны эксплуатироваться более двух лет.'},
                {'image': "icon/3.png", 'title': "Подача по городу", 'text': 'Арендованный Вами автомобиль может быть подан в любую точку города, туда, где Вам будет удобно забрать его. Это может быть Ваш адрес, любая станция метро, вокзал или аэропорт. В аэропорт «Пулково» и на Московский вокзал автомобили подаются бесплатно.'},
                {'image': "icon/4.png", 'title': "Гарантия низких цен", 'text': 'Мы — первая компания-дискаунтер на рынке аренды автомобилей. У нас Вы всегда найдете интересующий Вас автомобиль любого класса по лучшей цене в своем регионе. Клиентам гарантированы низкие цены на аренду автомобилей в сочетании с их высоким качеством.'},
            ]
        }
    },
}
</script>

<style>
.v-title {
    font-size: 40px;
    text-align: center;
    margin: 45px 0px;
}
</style>